//Task 1

//შექმენით ფუნქცია რომელიც დაბეჭდავს თქვენს სახელსა და გვარს და შემდეგ გამოიტანთ

function name() {
    console.log('erekle dzindzibadze')
}

name()
//შევქმენი ფუნცქცია რომელსაც დავარქვი სახელი(Name) და კონსოლში დავპრინტე ჩემი სახელი და გვარი და ბოლოში გამოვიძაკე ფუნქცია.

//________________________________________________________________//


//Task 2
// შექმენით ფუნქცია რომელიც გამოიტანს გამაფრთხილებელ მესიჯს, როდესაც თქვენ დააჭერთ ღილაკს სახელით "Know me"

function name() {
    console.log("erekle dzindzibadze");
}

//შევქმნეი ფუნქცია დავარქვი სახელი (name) და კონსოლ ლოგში დავპრონტე ჩერმი სახელი როცა ღილაკს დავაჭერ