#task 1
#შექმენით ცვლადი რომელშიც შეინახავთ ნივთის ფასს. მეორე ცვლადში შეინახეთ ნივთის რაოდენობა. თქვენი დავალებაა, რომ დაბეჭდოთ, თუ რამდენი უნდა გადაიხადოთ ნივთების ყიდვისას (ფასი * რაოდენობა)
note_book = 1.5
quantity = 12

print(note_book * quantity)


#task 2
#შექმენით ცვლადი, სადაც შეინახავთ თქვენს ასაკს. შემდეგ შექმენით მეორე ცვლადი, სადაც შეინახავთ ნებისმიერი ოჯახისწევრის ასაკს. თქვენი დავალებაა, რომ ჯერ დაბეჭდოთ თქვენს ასაკს + 10, შემდეგ ოჯახისწევრის ასაკს + 10.


#my age
num1 = 12 
print(num1 + 10)

#my brother
num2 = 32
print(num2 + 10)



#task 3
#შექმენით ორი ცვლადი, თითოეულში შეინახეთ ნებისმიერი რიცხვი. თქვენი დავალებაა, რომ არითმეტიკული მოქმედებების შედეგი დაბეჭდოთ ამ რიცხვებს შორის - ეს მოქმედებებია +, -, *, /


bus_gr = 50000
car_gr = 45000

#1)  
print(bus_gr * car_gr)
#2)
print(bus_gr - car_gr)
#3)
print(bus_gr / car_gr)
#4)
print(bus_gr + car_gr)


#task 4
#შექმენით ორი ცვლადი, პირველში თქვენი სახელი, ხოლო მეორეში ასაკი შეინახეთ. თქვენი დავალებაა, რომ ჯერ სახელი დაბეჭდოთ, შემდეგ კი ასაკი.

name = "erekle"

print(name)

age = 12

print(age)


