#task 1
#შექმენით პითონის ფაილი და 4 ჯერ გამოიყენეთ print ფუნქცია, პირველ პრინტში გამოიყენეთ ორ რიცხვს შორის შეკრება +, მეორეში - გამოკლება, მესამეში * გამრავლება, მეოთხეში / გაყოფა

print(3+1)
print(45-35)
print(100*10)
print(10/2)

#task 2
# შეართეთ ორი ტექსტური მონაცემი და კომენტარებით ახსენით რა შედეგი მიიღეთ.

num1 = "ere"
num2 = "kle"

print(num1 + num2)
#მე გამოვიყენე ჩემი სახელის პირველი 6 ასო (სამი ცალკე მეორე სამი ცალკე) და გამოვიდა ერთი მთლიანი სიტყვა erekle, ამ მოქმედებას ჰქვია ()


#task 3
#დაუშვით ძალით შეცდომები და ნახეთ კომპიუტერი რას გამოგიტანთ შედეგად.


# 1) print(num7 +num6)

#ამ შემთხვევაში ამ მოქმედების შესრულება შეიძლება მაგრამ თვითონ ცვლადო num7 num6 არ არის შექმნილი და კომპიუტერი რას მიამატებს...


# 2) print("hello world)

#აქ უბრალოდ ქოუთიშენ მარკები აკლია...


#task 4
#ყველა დაწერილი კოდი ახსენით კომენტარები + (დოკუმენტში კომენტარების ამოყენებით ქართული ენით ახსენით რა არის ტერმინალი და რისთვის ვიყენებთ)


#ტერმინალი არის ერთგვარი ფანგარა სადაც არის ჩვენს მიერ დაწერილი კოდების პასუხები ეს იქნება მათემატიკუ ისევე სხვა კოდებიიი ასწვე ტერმინალი გვეხმარება იმაში რიმ კოდი დავწერეთ სწორად თუ არასწორად..

#task 5
# შექმენით 2 ცვლადი, შეინახეთ მასში რიცხვები და საბოლოოდ დაბეჭდეთ ამ ორ ცვლადს შორის რომელიმე არითმეტიკული მოქმედება

erekle_balance = 45
data_balance = 35
#გავიგოთ რამდენით მეტია ერეკლეს ბალანსი  დათას ბალანსზე

print(erekle_balance + data_balance)

# taske 6
# ახსენით კომენტარებით რა არის სტრინგი და რა არის მთელი რიცხვი.

# str= "erekle"
# int= 7
# str გამოსახულება რომელიც არის ქოუტიშენ მარკებში შეიძლება ბევრს ეგონოს რომ STR არი ასოითი გამოსახულება მაგრამ ეს ეს არ არის მაგ "7"  ან "gfGGG"
# INT არის მთელი რიცხვი ქოუთშენ მარკების გარეშე...















